In [21]:
import numpy as np
import pandas as pd

frame = pd.Series(np.random.randn(9),
                  index=[
                      ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 2, 3, 1, 2, 3]
                  ])
frame

a  1   -1.900267
   2    0.423580
   3   -0.236587
b  1    1.295058
   2   -0.474111
c  3   -1.155351
   1   -0.593923
d  2   -0.378214
   3   -0.701656
dtype: float64

In [22]:
frame['b']

1    1.295058
2   -0.474111
dtype: float64

In [23]:
frame['b':'c']

b  1    1.295058
   2   -0.474111
c  3   -1.155351
   1   -0.593923
dtype: float64

In [24]:
frame['b'][2]

-0.47411064283930515

In [25]:
frame.unstack()

          1         2         3
a -1.900267  0.423580 -0.236587
b  1.295058 -0.474111       NaN
c -0.593923       NaN -1.155351
d       NaN -0.378214 -0.701656

In [26]:
frame.unstack().stack()

a  1   -1.900267
   2    0.423580
   3   -0.236587
b  1    1.295058
   2   -0.474111
c  1   -0.593923
   3   -1.155351
d  2   -0.378214
   3   -0.701656
dtype: float64

In [27]:
frame1 = pd.DataFrame(np.arange(12).reshape((4,3)),
                      index=[['a','a','b','b'],[1, 2, 1, 2]],
                      columns=[['台北','台北','台中'],['Green','Red','Green']])
frame1

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [28]:
frame1.index.names = ['key1', 'key2']
frame1

             台北        台中
          Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [29]:
frame1.columns.names = ['縣市','顏色']
frame1

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [30]:
frame1['台北']

顏色         Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10